rt/ws/security/src/test/resources/org/apache/cxf/ws/security/wss4j/signed_x509_issuer_serial_encrypted.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsse11:EncryptedHeader wsu:Id="EH-8df37af9-fa58-4cd9-85af-54f668acab9c" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-c6437398-37fa-456c-afc0-4d8047296fba" Type="http://www.w3.org/2001/04/xmlenc#Element" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-79045fd2-b8fa-4653-ba6f-bc0fcb93fc7e"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>k6SDbf0/47Y/d1NmRGQvd3OEVd7QZNEkxEZubmCLA18llyGokD0yI9E5nM2iM+8wjrdWc6KmaRDc9LQl1DEBJSvMQZVKTmGdWcZw5lM03hmEo4Uc7wq5Tr84YSVxTr3BW1b82a9E3kTTLzKUN+EPWrDy+aiqJ38S7xdsbFgXYkLuiOTweFtrZ39Tn0NLq21VsKLa/ZYOgPH4M2QqHNh51fmFHfcP3M5k8hlKVPvaZui6WemqT1LmeKAqUtVRpSu4QBSoK0kTeQgijHfQZy9IFg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></wsse11:EncryptedHeader>
        <wsse11:EncryptedHeader wsu:Id="EH-4759aa9d-1aed-45d3-a26c-1706054a8566" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-4a3f14b6-00ab-44c1-859d-7dee8828c3de" Type="http://www.w3.org/2001/04/xmlenc#Element" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-79045fd2-b8fa-4653-ba6f-bc0fcb93fc7e"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>fVJoqh57/9cASTJ3d9qEPJ8P6ZTrm8G27M77XaF9dSuevjB/JKqCo/j1EYkiDxpvuPijyUfOnH6Aypz796o+Fs1RDDCClv/SY4kdERvUNn7pbcgDNca6mlO3cYFEpoG0Nx+dzcz+J9pkA7cZVHe7vqwlVh++kct5xlNNHC7+2d+uVnRkxp/BvLGjOvzISP6ki9kmXvhNVA+YAHeaO7lKhZ6avGvRrLonib9vUOZvxBPofeymXAvA5NsPYVpxhcqMs3gNlQZ508f/vcyV3Z8A6Q==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></wsse11:EncryptedHeader>
    <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="Gc49d7471-6433-4773-9003-1fa13b3aae8c">MIIBmDCCAQECBEZu1OowDQYJKoZIhvcNAQEEBQAwEjEQMA4GA1UEAxMHbXlBbGlhczAgFw0wNzA2
MTIxNzE2MjZaGA80NzQ1MDUwOTE3MTYyNlowEjEQMA4GA1UEAxMHbXlBbGlhczCBnzANBgkqhkiG
9w0BAQEFAAOBjQAwgYkCgYEApeOd8EfprmTD+6/nOe3nK3eXFlPsaiRnz5+R3gA6xz4WOOOQX7l1
Pa4S65TZmVOxkfPzP+rFvbOJ4sn7ct0EtMiAYuqwnDiHVkqYIhz5WkoPBQet6J7dtcPIAEI9i5Mm
f5gsiIMTo8UxqXnsrjCNX6MSrLFr2yspdR/xFYK5IqkCAwEAATANBgkqhkiG9w0BAQQFAAOBgQB/
nqtFF6u4FJI90JS+RogSTYFc9mngpvXv8WJsfdR+IQovdFjzqCufOAGPctuq6olgW1A5DRNLIQwr
7sIPUhHBFZssuggwEQtF/lvJ51MGhp+pqySbpcPo31WppQO+t4Zsu78DZO4GB3Njr1MqOnux5gPG
HftujzlJh31SpkEfjA==</wsse:BinarySecurityToken><xenc:EncryptedKey Id="EK-79045fd2-b8fa-4653-ba6f-bc0fcb93fc7e" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:Reference URI="#Gc49d7471-6433-4773-9003-1fa13b3aae8c" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>VlB2a/DJhxhqLDce86k1E82CPXU5Y77Ts/urItzLGCZ709g1BXym2Y54g4sbhU7Gqw9XCycXIv9F
kLMKC4BsBFFO0cnTzAKrZTORUUO7VIDN2ck7/RSK31fA26pdIJM7ZKznigi1cxxwcrM4Cv0839wN
hX2HEEb/IJHOH/66tXU=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-c643a71b-017f-41f9-bfdf-813503135638"/><xenc:DataReference URI="#ED-c6437398-37fa-456c-afc0-4d8047296fba"/><xenc:DataReference URI="#ED-4a3f14b6-00ab-44c1-859d-7dee8828c3de"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-fffa43e9-ed34-4dc5-8109-abb166ccc65c">MIIBmDCCAQECBEZu1OowDQYJKoZIhvcNAQEEBQAwEjEQMA4GA1UEAxMHbXlBbGlhczAgFw0wNzA2
MTIxNzE2MjZaGA80NzQ1MDUwOTE3MTYyNlowEjEQMA4GA1UEAxMHbXlBbGlhczCBnzANBgkqhkiG
9w0BAQEFAAOBjQAwgYkCgYEApeOd8EfprmTD+6/nOe3nK3eXFlPsaiRnz5+R3gA6xz4WOOOQX7l1
Pa4S65TZmVOxkfPzP+rFvbOJ4sn7ct0EtMiAYuqwnDiHVkqYIhz5WkoPBQet6J7dtcPIAEI9i5Mm
f5gsiIMTo8UxqXnsrjCNX6MSrLFr2yspdR/xFYK5IqkCAwEAATANBgkqhkiG9w0BAQQFAAOBgQB/
nqtFF6u4FJI90JS+RogSTYFc9mngpvXv8WJsfdR+IQovdFjzqCufOAGPctuq6olgW1A5DRNLIQwr
7sIPUhHBFZssuggwEQtF/lvJ51MGhp+pqySbpcPo31WppQO+t4Zsu78DZO4GB3Njr1MqOnux5gPG
HftujzlJh31SpkEfjA==</wsse:BinarySecurityToken><ds:Signature Id="SIG-6410c479-e600-48e9-839a-6c03ceb3a8bf" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soap xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_1de9ae35-7c7d-43e2-8af5-68baa42ff7a5"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>FKbrsa7xOcm07kT3M8HMVSyEdC8=</ds:DigestValue></ds:Reference><ds:Reference URI="#_06a7fe2e-62c7-4359-912c-2543bd127e29"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soap xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>PAIqbWhL4y0ipUr5n8wyPVQ1AXA=</ds:DigestValue></ds:Reference><ds:Reference URI="#_60466dec-6880-45e7-bd57-b3ebb0ebcb88"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soap xsd xsi" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>olLG35HpFDofuaw5QUZefelJsDc=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>GUzzZAnsFJyDPwnrPze9bnze0R7s7+2dtGPwcAnOiQNEY39uWPWurDsM8ngOKAuZWV/yuxre638nv+vAVIWfj8D4NPE/X/L1DaRLdIWYq7CtMmq4rTxLA6VcR19aRfxVbG2ynbyZIan4FquGzxKATHWOMcDi3oW88LfMjPZ1fl8=</ds:SignatureValue><ds:KeyInfo Id="KI-ba9449d2-1298-412a-a4cc-2cda9ad8998b"><wsse:SecurityTokenReference wsu:Id="STR-55fe46bb-8ff9-4010-8fb1-6a0b878bbd20" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:Reference URI="#X509-fffa43e9-ed34-4dc5-8109-abb166ccc65c" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header>
    <soap:Body wsu:Id="_1de9ae35-7c7d-43e2-8af5-68baa42ff7a5" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData Id="ED-c643a71b-017f-41f9-bfdf-813503135638" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"><wsse:Reference URI="#EK-79045fd2-b8fa-4653-ba6f-bc0fcb93fc7e"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>h8qF8VPOGGALCwb/ID+ps8uFuRn+vvcw+QWd94Usjny7Q5OlTe8svR4ETzjoa8ZLoGuBwGmZ5fKOBqotBRsgBSGNESNt+YlfmwD4rTNoXwqlEtANyjXCYVXpH3/YwL1dYZ7wnj+Kk5sPeTce1HEmckVyeUWHj34FWI6ugXi0tv9GpDdlYodO+9IjXlHLFEHe</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body>
</soap:Envelope>
